<?php
ob_start();
?>

    <div id="smooth-purpose" class="faq-item">
        <h3>В чем смысл игры?</h3>
        <p>
            Игра "MindWarrior" была создана, чтобы поддерживать игроков на пути их личностного развития и роста.
            Это достигается с помощью фокусирования игроков на их ценных и сокровенных мыслях.
            Главная концепция игры – 🧪<a href="#formula"><i>"Формула твердой решимости"</i></a> – это вдохновляющее, приватное послание для
            себя, которое вы сами составляете, и которое вы регулярно просматриваете в течение всего дня.
        </p>

        <p>
            Всякий раз, когда вы 💫 просматриваете свою <i>Формулу</i>, ваши мысли возвращаются к тому, что действительно важно для вас.
            Эта практика поможет вам не утонуть в ежедневном потоке мелочных забот будней и оставаться сфокусированными на своих целях и ценностях.
        </p>

        <div style="display:none">
            <p>
            <ul>
                <li>Did you ever decide to change my life, for the better, before bed at night?
                    Did you forget about it on the next morning?</li>
                <li>Did you ever make a New Year resolution and then forgot about it a week later?</li>
            </ul>
            </p>

            <div class="images">
                <a href="/images/faq_en/res1.jpg" class="image-link" target="_blank"><img src="/images/faq_en/res1.jpg" width="300" style="border: 1px solid grey" /></a>
                <a href="/images/faq_en/res2.png" class="image-link" target="_blank"><img src="/images/faq_en/res2.png" width="300" style="border: 1px solid grey" /></a>
                <a href="/images/faq_en/res3.jpg" class="image-link" target="_blank"><img src="/images/faq_en/res3.jpg" width="300" style="border: 1px solid grey" /></a>
            </div>

            <p>
                The goal of the game is to empower you breaking this cycle.
            </p>
        </div>
    </div>

    <div id="smooth-formula" class="faq-item">
        <h3>Что написать в "Формуле"?</h3>

        <p>
            <i>"Формула твердой решимости"</i> – это приватное сообщение в свободной форме для себя. Там можно написать
            все, что вам хочется, и что будет нести для вас важный смысл. Может быть любимые цитаты, мантры, "напоминалки",
            мудрые мысли, наблюдения – только вам решать! Самое главное, что эта информация
            мотивировала вас на пути вашего личностного развития и роста.
        </p>
        <p>
            Хорошая, сильная <i>Формула</i> <a href="#review">поможет вам сконцентрироваться, будет вас поддерживать и мотивировать на вашем пути</a>.
            Если же вы постоянно пропускаете просмотры и игра напоминает вам о них, или вы задумались бросить игру,
            возможно это признак того, что нужно пересмореть и улучшить свою <i>Формулу</i>.
        </p>

    </div>

    <div id="smooth-review" class="faq-item">
        <h3>Что происходит, когда просматриваешь "Формулу"?'</h3>

        <p>
            В умозрительном плане, когда вы просматриваете свою <i>Формулу твердой решимости</i> с помощью команды 💫 <span class="pre">/review</span>, ваш
            ум возаращается к действительно важным для вас мыслям, тем самым вытягивая вас из круговорота мелочных
            проблем серых будней.
        </p>

        <p>
            С точки зрения игры, просмотры <i>Формулы</i> вознаграждаются игровыми очками 📈.
        </p>

        <p>
            <a href="/images/faq_en/review_plus_score.png" class="image-link" target="_blank>"><img src="/images/faq_en/review_plus_score.png" alt="Review plus score" title="Review plus score" width="400" /></a>
        </p>

        <p>
            Вы можете воспользоваться командой 📊 <span class="pre">/stats</span>, чтобы посмотреть детальную статистику вашей игры.
        </p>

        <p>
            <a href="/images/faq_en/stats.png" class="image-link" target="_blank>"><img src="/images/faq_en/stats.png" alt="Stats" title="Stats" width="400" /></a>
        </p>

        <p>
            Можно просматривать <i>Формулу</i> как угодно часто, но награда дается только за те просмотры, между которыми
            прошло хотя бы 5 минут.
        </p>

    </div>

    <div id="smooth-forgot" class="faq-item">
        <h3>Что будет, если забыть просмотреть "Формулу"?</h3>

        <p>
            Если вы забудете просмотреть вашу <i>Формулу твердой решимости</i> вовремя, и игра напомнила вам об этом, то вы потеряете
            игровые очки 📉.
        </p>

        <p>
            <a href="/images/faq_en/review_minus_score.png" class="image-link" target="_blank>"><img src="/images/faq_en/review_minus_score.png" alt="Review minus score" title="Review minus score" width="400" /></a>
        </p>

        <p>
            За первый пропущенный просмотр с вас спишутся 3 очка, а за каждый последующий все 6. Так будет происходить
            до тех пор, пока вы наконец не просмотрите свою <i>Формулу</i>.
        </p>
    </div>

    <div id="smooth-difficulty" class="faq-item">
        <h3>Как часто просматривать "Формулу"?</h3>

        <p>
            Частота просмотра зависит от уровня сложности игры. Вы начинаете играть с уровня "Легко" (2-й из 5-и),
            который вы можете изменить в любой момент игры с помощью команды 💪 <span class="pre">/difficulty</span>.

        </p>

        <table>
            <tr>
                <td>Новичок</td>
                <td>просмотр один раз в 2 часа</td>
            </tr>
            <tr>
                <td>Легко</td>
                <td>раз в 1 час 30 минут</td>
            </tr>
            <tr>
                <td>Средне</td>
                <td>раз в час</td>
            </tr>
            <tr>
                <td>Сложно</td>
                <td>раз в 45 минут</td>
            </tr>
            <tr>
                <td>Эксперт</td>
                <td>раз в 30 минут</td>
            </tr>
        </table>
    </div>

    <div id="smooth-pause" class="faq-item">
        <h3>Как без штрафов сделать перерыв от игры?</h3>

        <p>
            Если вам нужен перерыв, то воспользуйтесь командой "пауза" (⏸️ <span class="pre">/pause</span>).
        </p>

        <p>
            Пока игра "на паузе", вы не будете получать оповещения о пропущенных просмотрах <i>Формулы твердой решимости</i>, и с вас
            не будут списывать штрафные очки.
            Также не будет увеличиваться и активное время игры.
        </p>

        <p>
            Для возобновления игры просто просмотрите свое <i>Формулу</i> как обычно с помощью команды
            "просмотр" (💫 <span class="pre">/review</span>).
        </p>
    </div>

    <div id="smooth-formula-formatting" class="faq-item">
        <h3>Можно ли форматировать "Формулу"?</h3>

        <p>
            Редактор <i>Формулы</i> поддерживает <a href="https://www.markdownguide.org/cheat-sheet/" target="_blank">markdown</a>.
        </p>
        <p>
            <a href="/images/faq_en/markdown.png" class="image-link" target="_blank>"><img src="/images/faq_en/markdown.png" width="300" style="border: 1px solid grey" /></a>
        </p>
    </div>

    <div id="smooth-controls" class="faq-item">
        <h3>Какие команды игра понимает?</h3>
        <p>
            Чтобы начать играть, вам необходимо знать всего 3 команды:
        </p>
        <ul>
            <li><strong><span class="pre">/formula</span></strong> - 🧪 редактировать свою <a href="#formula"><i>Формулу твердой решимости</i></a></li>
            <li><strong><span class="pre">/review</span></strong> - 💫 <a href="#review">просмотреть</a> свою <i>Формулу</i>
            <li><strong><span class="pre">/pause</span></strong> - поставить игру ⏸️ <a href="#pause">на паузу</a></li>
        </ul>
        <p>
            Дополнительные команды:
        </p>
        <ul>
            <li><span class="pre">/stats</span> - 📊 просмотр детальной статистики игры</li>
            <li><span class="pre">/difficulty</span> - 💪 изменить <a href="#difficulty">сложность игры</a> (частоту просмотра <i>Формулы</i>)</li>
            <li><span class="pre">/data</span> - 🗂️ просмотр и управление своими данными</li>
        </ul>
    </div>


    <div id="smooth-name" class="faq-item">
        <h3>Что означает название "MindWarrior"?</h3>

        <div class="quote">
            <p>
                "Ни одна проблема не может быть решена на том же уровне сознания, на котором она была создана."
            </p>
            <p class="quote-reference">– <a href="https://ru.wikipedia.org/wiki/%D0%AD%D0%B9%D0%BD%D1%88%D1%82%D0%B5%D0%B9%D0%BD,_%D0%90%D0%BB%D1%8C%D0%B1%D0%B5%D1%80%D1%82" target="_blank">Альберт Эйнштейн</a></p>
        </div>

        &nbsp;
        <div class="quote">
            <p>
                "Ничего не может измениться для тех, кто сам не меняется."
            </p>
            <p class="quote-reference">– <a href="https://ru.wikipedia.org/wiki/%D0%AD%D0%BD%D0%B4%D0%B5,_%D0%9C%D0%B8%D1%85%D0%B0%D1%8D%D0%BB%D1%8C" target="_blank">Михаэль Энде</a></p>
        </div>
        &nbsp;
        <div class="quote">
            <p>
                "Дхаммы (элементы бытия) обусловлены разумом, их лучшая часть – разум, из разума они сотворены. Если кто-нибудь говорит или делает с чистым разумом, то за ним следует счастье, как неотступная тень."
            </p>
            <p class="quote-reference">– <a href="https://en.wikipedia.org/wiki/Buddha" target="_blank">Будда  (Дхаммапада 1.2)</a></p>
        </div>

        <p>
            Слово "Mind" в переводе означает "ум", "разум", "сознание". Оно намекает, что любые изменения в жизни как правило обусловлены
            внутренними изменениями и трансформациями в нашем сознании.
        </p>

        <p>
            Слово "Warrior" в переводе означает "воин". Оно намекает на действие, решимость, бесстрашие. Воин – это тот, кто
            принимает ответственность за свою жизнь и действия, и кто готов бороться за свои ценности и цели.
            Кроме этого, результат любого действия влияет не только на вашу жизнь, но и на жизни всех вокруг.
        </p>

        <div class="quote">
            <p>
                "Вчера я был умным, хотел изменить мир. Сегодня я мудрый, и поэтому меняю себя."
            </p>
            <p class="quote-reference">– <a href="https://ru.wikipedia.org/wiki/%D0%94%D0%B6%D0%B0%D0%BB%D0%B0%D0%BB%D0%B0%D0%B4%D0%B4%D0%B8%D0%BD_%D0%A0%D1%83%D0%BC%D0%B8" target="_blank">Руми</a></p>
        </div>
        &nbsp;
        <div class="quote">
            <p>
                "Будьте тем изменением, которое вы хотите увидеть в мире."
            </p>
            <p class="quote-reference">– <a href="https://ru.wikipedia.org/wiki/%D0%9C%D0%B0%D1%85%D0%B0%D1%82%D0%BC%D0%B0_%D0%93%D0%B0%D0%BD%D0%B4%D0%B8" target="_blank">Махатма Ганди</a></p>
        </div>
        &nbsp;
        <div class="quote">
            <p>
                "Каждый хочет изменить человечество, но никто не задумывается о том, как изменить себя"
            </p>
            <p class="quote-reference">– <a href="https://ru.wikipedia.org/wiki/%D0%A2%D0%BE%D0%BB%D1%81%D1%82%D0%BE%D0%B9,_%D0%9B%D0%B5%D0%B2_%D0%9D%D0%B8%D0%BA%D0%BE%D0%BB%D0%B0%D0%B5%D0%B2%D0%B8%D1%87" target="_blank"Лев Толстой</a></p>
        </div>

        <p>
            Мы, создатели игры, глубоко убеждены, что каждый человек способен изменить мир к лучшему.
            Изменяя себя, мы также вносим свой вклад в улучшение мира.
            Становясь лучше, мы принимаем лучшие решения, которые приводят к лучшим действиям и результатам, от которые
            влияют на всех вокруг нас.
        </p>

        <p>
            Поэтому, всякий раз, когда вы просматриваете свою <a href="#formula"><i>Формулу твердой решимости</i></a>, вы не просто улучшаете свою жизнь,
            но также улучшаете этот мир! 🙌
        </p>

        <p>В этом и заключается главная идея названия игры "MindWarrior" ¯\_(ツ)_/¯.</p>

    </div>

    <div id="smooth-formula-example" class="faq-item">
        <h3>Могу ли я смотреть "Формулы" других игроков?</h3>

        <p>
            Игра уважает вашу приватность.
            Ваша <i>Формула твердой решимости</i> хранится на вашем устройстве, и игра никогда его не копирует и не отправляет на свои сервера.
            Поэтому вы не можете свободно смотреть <i>Формулы</i> других игроков хотя бы просто потому, что
            игра сама не имеет к ним доступа. (См. детали в <a href="/privacy-policy.ru.<?=getenv('LINK_EXT');?>" target="_blank">политике конфиденциальности</a>.)
        </p>
        <p>
            Однако, <strong>некоторые игроки добровольно выложили свои <i>Формулы</i> в открытый доступ на нашем сайте</strong> на
            странице "<a href="https://mindwarriorgame.org/public-formulas.ru.html">Примеры Формул</a>".
            Заходите посмотреть, они могут вас вдохновить!
        </p>
        <p>
            Если вы сами хотите помочь другим игрокам и поделиться своей Формулой, выложив его в общий доступ, пожалуйста, следуйте
            <a href="https://github.com/mindwarriorgame/public-formulas/blob/main/README.en.md" target="_blank">этим инструкциям</a>.
        </p>
    </div>


    <div id="smooth-share" class="faq-item">
        <h3>Могу ли я поделиться своей "Формулой" с другими игроками?</h3>

        <p>
            См. <a href="#formula-example">выше</a>.
        </p>

    </div>

    <div id="smooth-privacy" class="faq-item">
        <h3>У кого есть доступ к моей "Йормуле"?</h3>

        <p>
            См. <a href="#formula-example">выше</a>.
        </p>
    </div>


<?php
$CONTENT = ob_get_contents();
ob_end_clean();

$LANG='ru';
$MENU = include("includes/menu.ru.php");

$TITLE="MindWarrior: Вопросы";

$CSS = ["/includes/faq_anchors.css"];
$JS = ["/includes/faq_anchors.js"];

include("includes/layout.php");
