<?php

return array(
    'quick-start' => 'Краткое руководство',
    'shared-letters' => 'Письма игроков',
    'privacy-policy' => 'Политика конфиденциальности',
    'faq' => 'Вопросы',
    'purpose' => 'В чем смысл игры?',
    'letter' => 'Что написать в "Письме"?',
    'review' => 'Что происходит, когда просматриваешь "Письмо"?',
    'forgot' => 'Что будет, если забыть просмотреть "Письмо"?',
    'difficulty' => 'Как часто просматривать "Письмо"?',
    'pause' => 'Как без штрафов сделать перерыв от игры?',
    'letter-formatting' => 'Можно ли форматировать "Письмо"?',
    'controls' => 'Какие команды игра понимает?',
    'name' => 'Что означает название "MindWarrior"?',
    'letter-example' => 'Могу ли я смотреть "Письма" других игроков?',
    'share' => 'Могу ли я поделиться своим "Письмом" с другими игроками?',
    'privacy' => 'У кого есть доступ к моему "Письму"?'
);